energia/Energia/hardware/msp430/cores/msp430/twi.c
/*
  ************************************************************************
  *	twi.c
  *
  *	Arduino core files for MSP430
  *		Copyright (c) 2012 Robert Wessels. All right reserved.
  *
  *
  ***********************************************************************
  Derived from:
  twi.c - TWI/I2C library for Wiring & Arduino
  Copyright (c) 2006 Nicholas Zambetti.  All right reserved.

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, write to the Free Software
  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
*/

#include <math.h>
#include <stdlib.h>
#include "Energia.h" // for digitalWrite

#if !defined(cbi)
#define cbi(sfr, bit) (_SFR_BYTE(sfr) &= ~_BV(bit))
#endif

#if !defined(sbi)
#define sbi(sfr, bit) (_SFR_BYTE(sfr) |= _BV(bit))
#endif

#include "wiring_private.h"
#include "pins_energia.h"
#include "twi.h"
#include "usci_isr_handler.h"

#if defined(__MSP430_HAS_USCI_B0__) || defined(__MSP430_HAS_USCI_B1__) || defined(__MSP430_HAS_EUSCI_B0__)
static boolean still_asleep;  // Used to validate whether a user ISR has issued wakeup() inside LPM3/LPM4 sleep modes.
#endif

static volatile uint8_t twi_state;
static volatile uint8_t twi_sendStop;           // should the transaction end with a stop
static volatile uint8_t twi_inRepStart;         // in the middle of a repeated start

static void (*twi_onSlaveTransmit)(void);
static void (*twi_onSlaveReceive)(uint8_t*, int);

static uint8_t twi_masterBuffer[TWI_BUFFER_LENGTH];
static volatile uint8_t twi_masterBufferIndex;
static uint8_t twi_masterBufferLength;

static volatile uint8_t twi_error;

static uint8_t twi_txBuffer[TWI_BUFFER_LENGTH];
static volatile uint8_t twi_txBufferIndex;
static volatile uint8_t twi_txBufferLength;
#if defined(__MSP430_HAS_USCI__) || defined(__MSP430_HAS_USCI_B0__) \
 || defined(__MSP430_HAS_USCI_B1__) || defined(__MSP430_HAS_EUSCI_B0__)
static uint8_t twi_rxBuffer[TWI_BUFFER_LENGTH];
static volatile uint8_t twi_rxBufferIndex;
#elif defined(__MSP430_HAS_USI__)
static uint8_t twi_slarw;
static uint8_t twi_my_addr;
#endif

#if defined(__MSP430_HAS_USCI__) || defined(__MSP430_HAS_USCI_B0__) || defined(__MSP430_HAS_USCI_B1__)
    volatile unsigned char* UCBxCTL0;
    volatile unsigned char* UCBxCTL1;
    volatile unsigned char* UCBxBR0;
    volatile unsigned char* UCBxBR1;
    volatile unsigned char* UCBxSTAT;
    const volatile unsigned char* UCBxRXBUF;
    volatile unsigned char* UCBxTXBUF;
    volatile unsigned char* UCBxIE;
    volatile unsigned char* UCBxIFG;
    volatile unsigned int* UCBxIV;
    volatile unsigned int* UCBxI2COA;
    volatile unsigned int* UCBxI2CSA;
#endif

/*
 * Function twi_init
 * Desc     readys twi pins and sets twi bitrate
 * Input    none
 * Output   none
 */
void twi_init(uint8_t module)
{
	// initialize state
	twi_state = TWI_IDLE;
	twi_sendStop = true;		// default value
	twi_inRepStart = false;

#if defined(__MSP430_HAS_USI__)
	/* 100 KHz for all */
#if (F_CPU >= 16000000L) || (F_CPU >= 12000000L)
	USICKCTL = USIDIV_7;
#elif defined(CALBC1_8MHZ_) && (F_CPU >= 8000000L)
	USICKCTL = USIDIV_6;
#elif defined(CALBC1_1MHZ_) && (F_CPU >= 1000000L)
	USICKCTL = USIDIV_3;
#endif
	/* Enable USI I2C mode. */
	USICTL1 = USII2C;
	/* SDA/SCL port enable and hold in reset */
	USICTL0 = (USIPE6 | USIPE7 | USISWRST);
	/* SMCLK and SCL inactive state is high */
	USICKCTL |= (USISSEL_2 | USICKPL);
	/* Disable automatic clear control */
	USICNT |= USIIFGCC;
	/* Enable USI */
	USICTL0 &= ~USISWRST;
	/* Counter interrupt enable */
	USICTL1 |= USIIE;
#elif defined(__MSP430_HAS_USCI__) || defined(__MSP430_HAS_USCI_B0__) || defined(__MSP430_HAS_USCI_B1__)
    /* Calling this dummy function prevents the linker
     * from stripping the USCI interupt vectors.*/ 
    usci_isr_install();

    /* Set pointers to correct USCI registers based on which module is being used */
    UCBxCTL0 =     &UCB0CTL0;
    UCBxCTL1 =     &UCB0CTL1;
    UCBxBR0 =      &UCB0BR0;
    UCBxBR1 =      &UCB0BR1;
    UCBxSTAT =     &UCB0STAT;
    UCBxRXBUF =    &UCB0RXBUF;
    UCBxTXBUF =    &UCB0TXBUF;
    UCBxIE =       &UCB0IE;
    UCBxIFG =      &UCB0IFG;
    UCBxI2COA =    &UCB0I2COA;
    UCBxI2CSA =    &UCB0I2CSA;
#if defined(__MSP430_HAS_USCI_B1__)
    if(module == 1) {
        UCBxCTL0 =     &UCB1CTL0;
        UCBxCTL1 =     &UCB1CTL1;
        UCBxBR0 =      &UCB1BR0;
        UCBxBR1 =      &UCB1BR1;
        UCBxSTAT =     &UCB1STAT;
        UCBxRXBUF =    &UCB1RXBUF;
        UCBxTXBUF =    &UCB1TXBUF;
        UCBxIE =       &UCB1IE;
        UCBxIFG =      &UCB1IFG;
        UCBxI2COA =    &UCB1I2COA;
        UCBxI2CSA =    &UCB1I2CSA;
    }
#endif

    //Disable the USCI module and clears the other bits of control register
    *UCBxCTL1 = UCSWRST;

     /*
     * Configure as I2C Slave.
     * UCMODE_3 = I2C mode
     * UCSYNC = Synchronous mode
     * UCCLK = SMCLK
     */
    *UCBxCTL0 = UCMODE_3 | UCSYNC;
    /*
     * Compute the clock divider that achieves less than or
     * equal to 100kHz.  The numerator is biased to favor a larger
     * clock divider so that the resulting clock is always less than or equal
     * to the desired clock, never greater.
     */
    *UCBxBR0 = (unsigned char)((F_CPU / TWI_FREQ) & 0xFF);
    *UCBxBR1 = (unsigned char)((F_CPU / TWI_FREQ) >> 8);

    /* Set pins to I2C mode */
    if(module == 1) {
        pinMode_int(TWISDA1, TWISDA_SET_MODE1);
        pinMode_int(TWISCL1, TWISCL_SET_MODE1);
    } else {
        pinMode_int(TWISDA, TWISDA_SET_MODE);
        pinMode_int(TWISCL, TWISCL_SET_MODE);
    }

    /* Enable the USCI module */
    *UCBxCTL1 &= ~(UCSWRST);

#if defined(__MSP430_HAS_USCI__)
    /* Set I2C state change interrupt mask */
    UCB0I2CIE |= (UCALIE|UCNACKIE|UCSTTIE|UCSTPIE);
    /* Enable state change and TX/RX interrupts */
    UC0IE |= UCB0RXIE | UCB0TXIE;
#else
    /* Set I2C state change interrupt mask and TX/RX interrupts */
    *UCBxIE |= (UCALIE|UCNACKIE|UCSTTIE|UCSTPIE|UCRXIE|UCTXIE);
#endif
#elif defined(__MSP430_HAS_EUSCI_B0__)
    P1SEL1 |= BIT6 + BIT7;                  // Pin init

    //Disable the USCI module and clears the other bits of control register
    UCB0CTLW0 = UCSWRST;

